import React from 'react'
import { connect } from 'react-redux';
import './index.css';

const About = () => (
    <div>
        <p className="paragraph-body">
            Проектът Pass FMI е създаден по инициатива на студенти, за да подпомага процеса по намиране на учебни материали, необходими за изучаваните курсове.<br/><br/>
            Това се осъществява чрез публикуване на обяви за продажба на учебни материали, които вече не са необходими на студентите. Тези обяви се разглеждат от потребителите
            и по този начин други студенти, които имат нужда от тези учебни материали, ще могат да се свържат със собствениците и да разберат как могат да се сдобият с тях. <br/><br/>
            В приложението потребителите могат да пишат и коментари относно състоянието на учебните материали или друга информация, която може да бъде полезна на потребителите.
            За публикуване, промяна на обява или писане на коментари е необходима регистрация и вход в системата, което може да се осъществи от началната страница.
        </p>
    </div>
);

export default connect()(About);
